scenario_descriptions = {
    "thread": {
        "define": {
            "define_1": "این همان سناریو کتاب است که 10 نخ ایجاد می شود و هر"
            " نخ بلافاصله شروع به کار می کند و سپس هر نخ به ترتیب Join می شود. در این سناریو هیچ همزمانی ای وجود ندارد و"
            " هر نخ به صورت کامل اجرا می شود و سپس نخ بعدی شروع به کار می کند. بنابر این زمان اجرای آن برابر با مجموع زمان اجرای هر نخ است.",
            "define_2": "این سناریو مشابه سناریو 1 است با این تفاوت که نخ ها همه"
            " در یک زمان ایجاد می شوند و پس از آنکه همه نخ ها ایجاد شدند "
            " join می شوند. در این حالت نخ ها به صورت موازی اجرا"
            " می شوند و زمان اجرای آن نسبت به حالت ترتیبی بسیار کمتر است",
            "define_3": "در این سناریو هر نخ کار متفاوتی انجام میدهد و برای اینکه موازی بودن اجرای"
            " نخ ها را نمایش دهیم زمان پایان کار هر نخ را نیز چاپ می کنیم"
        },
        "current": {
            "current_1": "این سناریو برای نمایش نام نخ ها است. در این سناریو هر نخ نام خودش را در خروجی چاپ می کند",
            "current_2": "در این سناریو هر نخ عملیات خاصی را انجام می دهد و مراحل هر عملیات توسط نام نخ در خروجی چاپ می شود",
            "current_3": "در این سناریو 3 نخ ایجاد شده است که هرکدام یک کار را شبیه سازی می کنند. نخ اول شبیه سازی دانلود فایل را انجام می دهد، نخ دوم برای پردازش و نخ سوم نتایج را ذخیره می کند"
        },
        "subclass": {
            "subclass_1": "برای ساخت یک نخ، می‌توان یک کلاس جدید تعریف کرد که از کلاس Thread ارث‌بری می‌کند. این کلاس باید متد run را بازنویسی کند تا رفتار نخ مشخص شود. هر شی که از این کلاس ساخته می شود خودش یک نخ است",
            "subclass_2": "مثال شبیه سازی دانلود، پردازش و ذخیره سازی نتایج با استفاده از subclass: در  این مثال هر شی از کلاس یک نخ می باشد که عملیات دانلود، پردازش و ذخیره سازی نتایج را به صورت جداگانه انجام می دهد و نتایج در خروجی چاپ می گردد",
            "subclass_3": "در این سناریو رفتار ربات های یک کارخانه شبیه سازی شده است. هر ربات یک نخ است که کاری را آغاز می کند، مدت زمانی طول می کشد و کار خاتمه می یابد. از subclass استفاده شده است هر نخ بنا بر وظیفه خود متد run را پیاده سازی می کند"
        },
        "lock": {
            "lock_1": "سناریو 1 همان سناریو کتاب است. در این سناریو 10 نخ "
            "به صورت همزمان اجرا می شوند. سپس هریک از نخ ها به ترتیب Join می شوند و با استفاده از lock هیچ دو نخی اجازه ورود همزمان به ناحیه بحرانی را ندارند",
            "lock_2": "در این سناریو 5 کاربر وجود دارد که در زمان های تصادفی در یک صفحه وب "
            "اقدام به نوشتن مقاله می کنند. منطق سناریو به این صورت است که "
            "هر کاربری که توکن را در اختیار بگیرد شروع به نوشتن می کند و "
            "مقاله را منتشر می کند و در این زمان هیچ کاربر دیگری مجاز به نوشتن در صفحه وب نیست",
            "lock_3": "در این سناریو هر مشتری در زمان تصادفی برای رزرو صندلی"   
            " سینما اقدام می کند. اولین مشتری که قفل را در اختیار می گیرد لیست صندلی "
            "های قابل انتخاب را می بیند سپس اقدام به انتخاب صندلی می کند و در نهایت "
            "صندلی را رزرو می کند. پس از رزرو صندلی آن صندلی از لیست صندلی های قابل"
            " انتخاب خارج می شود و به لیست صندلی های رزرو شده اضافه می شود که برای"
            " مشتری های دیگر نمایش داده نشود. در این حالت قفل اجازه نمی دهد نخ دیگری"
            " اقدام به دیدن، انتخاب و رزرو صندلی کند. اما در صورتی که قفل برداشته شود"
            " چندین نخ قادر به مشاهده یک لیست یکسان از صندلی های قابل انتخاب هستند.",
        },
        "rlock": {
            "rlock_1": "در این سناریو دو نخ وجود دارد که یکی وظیفه اضافه کردن آیتم و دیگری وظیفه حذف کردن آیتم ها را بر عهده دارد که همزمانی آنها با استفاده از rlock انجام می شود",
            "rlock_2": "در این سناریو عملیات بانکی شبیه سازی شده است. دو حساب بانکی از کلاس BankAccount ساخته شده اند و آن کلاس از Thread ارث بری می کند. برای انتقال وجه خود عملیات انتقال به قفل نیاز دارد. از آنجا که هر انتقال یک برداشت و یک واریز نیاز دارد آن عملیات ها هم در درون انتقال به قفل نیاز داردند که RLock این نیاز را برطرف کرده است",
            "rlock_3": "در این سناریو دو سبد خرید وجود دارد که اقلامی به آنها اضافه و اط آنها حذف می شود. هر بار که کالایی به سبد اضافه می شود یا از آن حذف می شود این عمل نیاز به قفل دارد و در داخل عملیات حذف یا اضافه نیاز است تابع update نیز برای محاسبه مبلغ نهایی سبد صدا زده شود. خود این تابع نیز به قفل نیاز دارد که از RLock استفاده شده است.",
        },
        "semaphore": {
            "semaphore_1": "در این مثال 5 فیلسوف وجود دارد که هرکدام به 2 چنگال برای غذا خوردن نیاز دارند. همچنین 5 چنگال وجود دارد. برای جلوگیری از برداشتن همزمان یک چنگال توسط 2 فیلسوف از یک سمافور باینری استفاده کرده ایم و برای جلوگیری از بن بست هر بار فقط 4 فیلسوف حق ورود به اتاق غذا خوری را دارند چرا که اگر 5 فیلسوف وارد شود و هرکدام برای مثال چنگال سمت چپ را بردارند الگوریتم دچار بن بست می شود",
            "semaphore_2": "در این سناریو آرایشگر منتظر مشتری می ماند تعداد صندلی های انتظار 3 عدد اگر مشتری بیشتر از تعداد صندلی های انتظار باشد بر می گردد. وقتی مشتری وارد آرایشگاه می شود آرایشگر از خواب بیدار می شود و شروع می کند به اصلاح. کار مشتری تمام شد نفر بعدی را صدا میزند و یک صندلی انتظار نیز برای مشتری جدید خالی می شود",
            "semaphore_3": "در این سناریو 20 نخ درخواست دستری به پایگاه داده را دارند. پایگاه داده اجازه بیشتر از 5 اتصال همزمان را نمی دهد. بنابراین از یک سمافور برای مدیریت اتصال به پایگاه داده استفاده کرده ایم. ",
            
        },
        "condition": {
            "condition_1": "در این سناریو یک تولید کننده و یک مصرف کننده وجود دارد. تولید کننده هر 0.5 ثانیه یک آیتم تولید می کند. مصرف کننده هر 2 ثانیه یک آیتم مصرف می کند. اگر بافر پر باشد تولید کننده باید منتظر بماند و اگر بافر خالی باشد مصرف کننده باید منتظر بماند. تولید کننده و مصرف کننده با condition به هم سیگنال می دهند",
            "condition_2": "در این سناریو چند کارمند درخواست چاپ فایل هایشان را برای صف چاپ ارسال می کنند. فقط یک چاپگر وجود دارد. زمانی که کاری در صف چاپ وجود ندارد چاپگر میخوابد و وقتی یک کار جدید وارد صف کار می شود چاپگر بیدار می شود و آن کار را چاپ می کند. اندازه صف 5 است و چاپ هر کار 1.5 ثانیه زمان لازم دارد. در صورتی که صف پر باشد کارمند باید منتظر خالی شدن صف بماند",
            "condition_3": "در این سناریو گارسون سفارش ها رو از مشتری می گیرد و در صف قرار میدهد. آشپز باید منتظر بماند که سفارشی در صف قرار بگیرد. تا زمانی که سفارشی وجود ندارد آشپز می خوابد. اگر صف سفارش پر باشد گارسون باید منتظر بماند صف خالی شود بعد یک سفارش جدید ثبت کند",
        },
        "event": {
            "event_1": "مثال تولید کننده و مصرف کننده با استفاده از Event",
            "event_2": "در این سناریو یک فایل دانلودر وجود دارد و چند نخ که وظیفه پردازش فایل را بر عهده دارند. پردازش کننده ها باید منتظر بمانند که فایل دانلود شود به محض دانلود شدن فایل کار نخ های پردازش کننده شروع می شود",
            "event_3": "در این سناریو چراغ راهنمایی شبیه سازی شده است. به این صورت که خودرو ها (نخ ها) منتظر می مانند که چراغ سبز شود به محض سبز شدن چراغ، خودروها حرکت می کنند و چراغ که قرمز شد (event.clear) همه ماشین ها متوقف می شوند. در این مثال از 2 نخ برای چراغ استفاده شده است یک نخ برای چراغ سبز و یک نخ برای چراغ قرمز که این دو نخ با event به هم سیگنال می فرستند",
        },
        "barrier": {
            "barrier_1": "مثال دونده ها با استفاده از Barrier",
            "barrier_2": "در این سناریو 3 فایل باید کامل دانلود شوند. بعد از اینکه دانلود شدند هر 3 فایل باید پردازش شوند و بعد از پردازش هر 3 فایل باید ذخیره شوند",
            "barrier_3": "در این سناریو 3 محصول وجود دارد که در مرحله اول هر 3 تولید میشوند. در مرحله بعد رنگ آمیزی و در مرحله آخر بسته بندی می شوند. نکته این است که هیچ محصوری نمیتواند به تنهایی به مرحله بعد برود باید در هر مرحله صبر کنند 3 محصول کارشان تمام شود",
        },
        "queue": {
            "queue_1": "در این سناریو یک تولید کننده محصولاتی را تولید می کند و در صف قرار می دهد. 3 مصرف کننده از آن صف محصولات رو مصرف می کنند",
            "queue_2": "در این سناریو سفارش های غذا توسط آشپز تهیه و در یک صف قرار می گیرند. 3 پیک وجود دارد که هرکدام از راه برسند صف را چک میکنند و اولین سفارش را بر می دارند",
            "queue_3": "در این سناریو سفارش های فروشگاه آنلاین در صف قرار می گیرند و به ترتیب پردازش می شوند",
        },
    },

    "process": {
        "spawning": {
            "spawn_1": "در این سناریو تعدادی فرآیند اجرا می شود که خروجی آنها به صورت ترتیبی نمایش داده می شود",
            "spawn_2": "در این سناریو تعدادی فرآیند ایجاد می شود و وخروجی آنها به صورت موازی نمایش داده می شود",
            "spawn_3": "در این سناریو 3 فرآیند با وظایف مختلف وجود دارد که هرکدام کار مختص به خود را انجام می دهند",
        },
        "naming": {
            "naming_1": "در این سناریو 2 نخ ایجاد می شود. نخ اول نامگذاری می شود و نام آن در خروجی چاپ می شود اما نخ دوم از نام پیشفرض استفاده می کند",
            "naming_2": "در این سناریو 3 نخ وجود دارد که هرکدام کار خاصی انجام میدهد و نتیجه هر عمل با نام فرآیند در خروجی چاپ می شود",
            "naming_3": "در این سناریو 3 نخ وظایف کدگذاری، کدگشایی و هش کردن دیتا را بر عهده دارند که خروجی کار هرکدام به همراه نام آنها نمایش داده می شود",
        },
        "background": {
            "background_1": "در این سناریو دو فرآیند وجود دارد که یکی در پس زمینه اجرا می شود و دیگری در پس زمینه نیست. فرآیندی که در پس زمینه اجرا میشود اعداد 0 تا 4 را چاپ می کند و دیگری اعداد 5 تا 9 را چاپ می کند",
            "background_2": "در این سناریو  2 فرآیند وجود دارد. یک فرآیند در یک فایل می نویسد که زمان نوشتن بین 3 تا 5 ثانیه طول می کشد. فرآیند دوم در پس زمینه اجرا می شود و هر 1 ثانیه یکبار تغییرات را ذخیره می کند",
            "background_3": "در این سناریو یک فرایند کار ارسال پیام را انجام می دهد که هر 2 تا 4 ثانیه یک پیام ارسال می کند و یک فرایند در پس زمینه وجود دارد که دائو در حال گوش دادن به خط است و به محض اینکه پیامی دریافت کند آنرا نمایش می دهد",
        },
        "killing": {
            "killing_1": "در این سناریو یک فرآیند ایجاد می شود و سپس خاتمه داده می شود و در هر مرحله وضعیت فرایند بررسی می گردد",
            "killing_2": "در این سناریو 3 فرایند وجود دارد با زمان اجرای تصادفی بین 1 تا 10 ثانیه. در صورتی که فرایندی زیر 5 ثانیه خاتمه یابد نرمال است و زمان اجرای آن چاپ می شود. در صورتی که بیشتر از 5 ثانیه طول بکشد توسط ناظر پایان می یابد",
            "killing_3": "فرایندی که شروع شود ولی join نشود به عنوان فرایند زامبی شناخته می شود. در این سناریو فرایند زامبی شناسایی می شود و خاتمه می یابد",
        },
        "subclass": {
            "subclass_1": "در این سناریو 10 شی از کلاس MyProcess ایجاد می شود که این کلاس از multipricessing ارث می برد سپس  هر کدام تابع run را اجرا می کند",
            "subclass_2": "در این سناریو یک ساب کلای که از multiprocessing ارث بری می کند یک عدد از ورودی می گیرد و مربع آن را محاسبه می کند",
            "subclass_3": "در این سناریو یک ساب کلاس که از multiprocessing ارث بری می کند یک پیام از ورودی می گیرد و آن را پردازش می کند و نتیجه را چاپ می کند",
        },
        "queue": {
            "queue_1": "در این سناریو یک صف وجود دارد. یک تولید کننده و یک مصرف کننده. تولید کننده یک آیتم تولید می کند و در صف قرار می دهد. مصرف کننده یک آیتم از صف مصرف می کند. اگر صف پر باشد تولید کننده باید صبر کند که مصرف کننده یک آیتم مصرف کند و بعد آبتم جدید تولید کند. همچنین اگر صف خالی باشد مصرف کننده باید صبر کند تولید کننده یک آیتم تولید کند سپس آن را مصرف کند",
            "queue_2": "در این سناریو یک صف با طول 5 وجود دارد. یک فرایند job هایی ایجاد می کند و در صف قرار می دهد. یک فرایند دیگر job ها را روی پردازنده ها که تعداد آنها 3 عدد است توزیع می کند در صورتی که همه پردازنده ها مشغول باشند توزیع کننده صبر می کند که یک پردازنده آزاد شود",
            "queue_3": "در این سناریو یک فرستنده وجود دارد که با سرعتی 2 برابر گیرنده داده ها را ارسال می کند. برای اینکه سرعت فرستنده محدود به گیرنده نباشد و داده ای هم از دست نرود از یک صف برای بافر کردن استفاده شده است",
        },
        "pipe": {
            "pipe_1": "در این سناریو دو پایپ برای داده های ورودی و مربع آنها در نظر گرفته شده است. دو فرایند وجود دارد. یکی داده ها را از ورودی می گیرد و در pipe اول قرار می دهد. فرایند دوم مربع داده های ورودی را در pipe دوم قرار می دهد",
            "pipe_2": "در این سناریو دو فرایند وجود دارد. یکی رشته تولید می کند و در pipe قرار می دهد و دیگری رشته را برعکس کرده و در pipe خروجی قرار می دهد",
            "pipe_3": "در این سناریو دو فرایند وجود دارد که یکی اعدادی را تولید می کند و در pipe قرار می دهد و فرایند دیگر فاکتوریل اعداد را محاسبه می کند و در pipe خروجی قرار می دهد",
        },
        "barrier": {
            "barrier_1": "در این سناریو 2 فرایند با استفاده از barrier هماهنگ میشوند که درقیقا در یک زمان به Barrier میرسند اما 2 فرایند دیگر وجو دارد که بدون barrier در زمان های مختلفی می رسند",
            "barrier_2": "این سناریو شبیه سازی پردازش 4 تصویر است که با استفاده از barrier همه فرایند ها در هر مرحله منتظر می مانند که پردازش همه فرایند ها به اتمام برسد بعد مرحله بعدی را آغاز می کنند",
            "barrier_3": "در این سناریو برای محاسبه معدل فرایند ها باید صبر کنند که نمره هر درس آماده شود سپس محاسبه را انجام دهند که این کار با barrier انجام می شود",
        },
        "pool": {
            "pool_1": "در این سناریو از تابع map استفاده شده است که یک تابع روی مجموعه مختلفی از داده ها اجرا می شود. به عبارتی یک عمل مشابه روی مجموعه ای از داده ها به صورت موازی اجرا می شود",
            "pool_2": "در این سناریو تعدادی پسورد وجود دارد که توسط یک تابع به صورت موازی هش می شوند",
            "pool_3": "تعدادی فایل متنی دارد. توسط فرایندی تعداد کلمات هر فایل را محاسبه می شود. به جای اینکه یک Process همه فایل‌ها را یکی‌یکی بخواند، با Pool چند Process همزمان این کار را انجام می‌دهند.",
        },
               
    }
}